<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"99545b8b397a494af4190db4e9695056e89129b993041b8012ed8ffdca494a05","plan_job_ref":"Job Create Terraform plan (DEV) #182 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15470543743","plan_out_hash":"87ec2ede3343160feb912b94737be307de9d32cd65b2ecfd9f879d77c47f0108","plan_hash":"51b8fd58c2e7fd84ade3c8e4898d963da4ab7f9a68232954eb3b83cc784b0cb1","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 11 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_container_registry.acr will be created
+   resource "azurerm_container_registry" "acr" {
+       admin_enabled                 = false
+       admin_password                = (sensitive value)
+       admin_username                = (known after apply)
+       encryption                    = (known after apply)
+       export_policy_enabled         = true
+       id                            = (known after apply)
+       location                      = "francecentral"
+       login_server                  = (known after apply)
+       name                          = "openmrsacrdev"
+       network_rule_bypass_option    = "AzureServices"
+       network_rule_set              = (known after apply)
+       public_network_access_enabled = true
+       resource_group_name           = "rg-openmrscore-dev"
+       sku                           = "Standard"
+       trust_policy_enabled          = false
+       zone_redundancy_enabled       = false
    }

  # azurerm_dns_zone.audioprothese_ovh will be created
+   resource "azurerm_dns_zone" "audioprothese_ovh" {
+       id                        = (known after apply)
+       max_number_of_record_sets = (known after apply)
+       name                      = "audioprothese.ovh"
+       name_servers              = (known after apply)
+       number_of_record_sets     = (known after apply)
+       resource_group_name       = "rg-openmrscore-dev"

+       soa_record (known after apply)
    }

  # azurerm_federated_identity_credential.eso_federated_identity will be created
+   resource "azurerm_federated_identity_credential" "eso_federated_identity" {
+       audience            = [
+           "api://AzureADTokenExchange",
        ]
+       id                  = (known after apply)
+       issuer              = (known after apply)
+       name                = "eso-federated-credential"
+       parent_id           = (known after apply)
+       resource_group_name = "rg-openmrscore-dev"
+       subject             = "system:serviceaccount:eso:workload-identity-sa"
    }

  # azurerm_key_vault.vault will be created
+   resource "azurerm_key_vault" "vault" {
+       access_policy                 = (known after apply)
+       enable_rbac_authorization     = true
+       enabled_for_disk_encryption   = true
+       id                            = (known after apply)
+       location                      = "francecentral"
+       name                          = "openmrs-dev-vault"
+       public_network_access_enabled = true
+       purge_protection_enabled      = false
+       resource_group_name           = "rg-openmrscore-dev"
+       sku_name                      = "standard"
+       soft_delete_retention_days    = 7
+       tenant_id                     = "************************************"
+       vault_uri                     = (known after apply)

+       contact (known after apply)

+       network_acls (known after apply)
    }

  # azurerm_kubernetes_cluster.aks will be created
+   resource "azurerm_kubernetes_cluster" "aks" {
+       current_kubernetes_version          = (known after apply)
+       dns_prefix                          = "openmrs-dev-audioprothese-dns-aks"
+       fqdn                                = (known after apply)
+       http_application_routing_zone_name  = (known after apply)
+       id                                  = (known after apply)
+       kube_admin_config                   = (sensitive value)
+       kube_admin_config_raw               = (sensitive value)
+       kube_config                         = (sensitive value)
+       kube_config_raw                     = (sensitive value)
+       kubernetes_version                  = (known after apply)
+       location                            = "francecentral"
+       name                                = "openmrs-dev-audioprothese-aks"
+       node_os_upgrade_channel             = "NodeImage"
+       node_resource_group                 = (known after apply)
+       node_resource_group_id              = (known after apply)
+       oidc_issuer_enabled                 = true
+       oidc_issuer_url                     = (known after apply)
+       portal_fqdn                         = (known after apply)
+       private_cluster_enabled             = false
+       private_cluster_public_fqdn_enabled = false
+       private_dns_zone_id                 = (known after apply)
+       private_fqdn                        = (known after apply)
+       resource_group_name                 = "rg-openmrscore-dev"
+       role_based_access_control_enabled   = true
+       run_command_enabled                 = true
+       sku_tier                            = "Free"
+       support_plan                        = "KubernetesOfficial"
+       tags                                = {
+           "Environment"  = "dev"
+           "organization" = "audioprothese"
+           "project"      = "openmrs"
        }
+       workload_identity_enabled           = true

+       auto_scaler_profile (known after apply)

+       default_node_pool {
+           kubelet_disk_type    = (known after apply)
+           max_pods             = (known after apply)
+           name                 = "default"
+           node_count           = 2
+           node_labels          = (known after apply)
+           orchestrator_version = (known after apply)
+           os_disk_size_gb      = (known after apply)
+           os_disk_type         = "Managed"
+           os_sku               = (known after apply)
+           scale_down_mode      = "Delete"
+           type                 = "VirtualMachineScaleSets"
+           ultra_ssd_enabled    = false
+           vm_size              = "Standard_D2_v2"
+           workload_runtime     = (known after apply)
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       kubelet_identity (known after apply)

+       network_profile (known after apply)

+       web_app_routing {
+           dns_zone_ids             = (known after apply)
+           web_app_routing_identity = (known after apply)
        }

+       windows_profile (known after apply)
    }

  # azurerm_role_assignment.acr_pull will be created
+   resource "azurerm_role_assignment" "acr_pull" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "AcrPull"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.aks_dns will be created
+   resource "azurerm_role_assignment" "aks_dns" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "DNS Zone Contributor"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.eso_keyvault_secrets_user will be created
+   resource "azurerm_role_assignment" "eso_keyvault_secrets_user" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Secrets User"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.external_dns will be created
+   resource "azurerm_role_assignment" "external_dns" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "DNS Zone Contributor"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.user_keyvault_secret_access will be created
+   resource "azurerm_role_assignment" "user_keyvault_secret_access" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = "User"
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Key Vault Administrator"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_user_assigned_identity.eso_workload_identity will be created
+   resource "azurerm_user_assigned_identity" "eso_workload_identity" {
+       client_id           = (known after apply)
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "eso-workload-identity"
+       principal_id        = (known after apply)
+       resource_group_name = "rg-openmrscore-dev"
+       tenant_id           = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   name_servers = (known after apply)
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #182](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15470543743)